nrfconnect/sdk-nrf/subsys/mpsl/fem/hot_potato/radio_test_nrf54l/src/radio_cmd.c
/*
 * Copyright (c) 2020-2025 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 */

#include <stdlib.h>

#include <zephyr/kernel.h>
#include <hal/nrf_gpio.h>
#include <hal/nrf_power.h>
#include <openthread/cli.h>

#include "radio_test.h"

#if NRF_POWER_HAS_DCDCEN_VDDH
#define TOGGLE_DCDC_HELP                                                                           \
	"Toggle DCDC state <state>, "                                                              \
	"if state = 1 then toggle DC/DC state, or "                                                \
	"if state = 0 then toggle DC/DC VDDH state"
#elif NRF_POWER_HAS_DCDCEN
#define TOGGLE_DCDC_HELP                                                                           \
	"Toggle DCDC state <state>, "                                                              \
	"Toggle DC/DC state regardless of state value"
#endif

#define shell_print(fmt, ...)	otCliOutputFormat(fmt "\r\n" __VA_OPT__(, ) __VA_ARGS__)
#define shell_hexdump(ptr, len) otCliOutputBytes(ptr, len), otCliOutputFormat("\r\n")

/* Subcommand definition */
struct radio_test_cmd {
	const char *name;
	const char *help;
	otError (*handler)(void *ctx, uint8_t argc, char *argv[]);
};

/* Execute one of the subcommands */
otError exec_subcommand(struct radio_test_cmd cmd[], size_t num, void *ctx, uint8_t argc,
			char *argv[])
{
	if (argc == 0 || strcmp(argv[0], "help") == 0) {
		for (size_t i = 0; i < num; i++) {
			otCliOutputFormat("%-30s : %s\r\n", cmd[i].name, cmd[i].help);
		}

		return argc == 0 ? OT_ERROR_INVALID_ARGS : OT_ERROR_NONE;
	}

	for (size_t i = 0; i < num; i++) {
		if (strcmp(argv[0], cmd[i].name) == 0) {
			return cmd[i].handler(ctx, argc - 1, argv + 1);
		}
	}

	return OT_ERROR_INVALID_ARGS;
}

/* Radio parameter configuration. */
static struct radio_param_config {
	/** Radio transmission pattern. */
	enum transmit_pattern tx_pattern;

	/** Radio mode. Data rate and modulation. */
	nrf_radio_mode_t mode;

	/** Radio output power. */
	int8_t txpower;

	/** Radio start channel (frequency). */
	uint8_t channel_start;

	/** Radio end channel (frequency). */
	uint8_t channel_end;

	/** Delay time in milliseconds. */
	uint32_t delay_ms;

	/** Duty cycle. */
	uint32_t duty_cycle;

	/** Interval. */
	uint32_t interval;

	bool crc_enabled;
} config = {
	.tx_pattern = TRANSMIT_PATTERN_RANDOM,
	.mode = NRF_RADIO_MODE_BLE_1MBIT,
	.txpower = 0,
	.channel_start = 0,
	.channel_end = 80,
	.delay_ms = 10,
	.duty_cycle = 50,
	.crc_enabled = true,
	.interval = 100,
};

/* Radio test configuration. */
static struct radio_test_config test_config;

/* If true, RX sweep, TX sweep or duty cycle test is performed. */
static bool test_in_progress;

/* If true, RX test is performed. */
static bool rx_test_in_progress;

K_SEM_DEFINE(cpu_activity_thread_start, 0, 1);
volatile uint8_t cpu_activity;
volatile uint8_t cpu_activity_duty_cycle;
volatile uint8_t cpu_active;

static void cpu_duty_cycle_timer_handler(struct k_timer *timer_id)
{
	ARG_UNUSED(timer_id);
	cpu_active = false;
}

K_TIMER_DEFINE(cpu_duty_cycle_timer, cpu_duty_cycle_timer_handler, NULL);

#if CONFIG_HAS_HW_NRF_RADIO_IEEE802154
static void ieee_channel_check(uint8_t channel)
{
	if (config.mode == NRF_RADIO_MODE_IEEE802154_250KBIT) {
		if ((channel < IEEE_MIN_CHANNEL) || (channel > IEEE_MAX_CHANNEL)) {
			shell_print("For %s config.mode channel must be between %d and %d",
				    STRINGIFY(NRF_RADIO_MODE_IEEE802154_250KBIT), IEEE_MIN_CHANNEL,
					      IEEE_MAX_CHANNEL);

			shell_print("Channel set to %d", IEEE_MIN_CHANNEL);
		}
	}
}
#endif /* CONFIG_HAS_HW_NRF_RADIO_IEEE802154 */

static otError cmd_gpio_set(void *ctx, uint8_t argc, char *argv[])
{
	if (argc != 2) {
		shell_print("Bad parameters count");
		return OT_ERROR_INVALID_ARGS;
	}

	uint8_t gpio_port = atoi(argv[0]);
	uint8_t gpio_pin = atoi(argv[1]);
	if (gpio_port > 2) {
		shell_print("Invalid GPIO port: %d. Should be between 0-2", gpio_port);
		return OT_ERROR_INVALID_ARGS;
	}
	if (gpio_pin > 31) {
		shell_print("Invalid GPIO pin: %d. Should be between 0-31", gpio_pin);
		return OT_ERROR_INVALID_ARGS;
	}
	uint32_t gpio_pin_port_map = NRF_GPIO_PIN_MAP(gpio_port, gpio_pin);
	nrf_gpio_cfg_output(gpio_pin_port_map);
	nrf_gpio_pin_set(gpio_pin_port_map);
	shell_print("GPIO P%d.%d set to logic high", gpio_port, gpio_pin);
	return OT_ERROR_NONE;
}

static otError cmd_gpio_clear(void *ctx, uint8_t argc, char *argv[])
{
	if (argc != 2) {
		shell_print("Bad parameters count");
		return OT_ERROR_INVALID_ARGS;
	}

	uint8_t gpio_port = atoi(argv[0]);
	uint8_t gpio_pin = atoi(argv[1]);
	if (gpio_port > 2) {
		shell_print("Invalid GPIO port: %d. Should be between 0-2", gpio_port);
		return OT_ERROR_INVALID_ARGS;
	}
	if (gpio_pin > 31) {
		shell_print("Invalid GPIO pin: %d. Should be between 0-31", gpio_pin);
		return OT_ERROR_INVALID_ARGS;
	}
	uint32_t gpio_pin_port_map = NRF_GPIO_PIN_MAP(gpio_port, gpio_pin);
	nrf_gpio_cfg_output(gpio_pin_port_map);
	nrf_gpio_pin_clear(gpio_pin_port_map);
	shell_print("GPIO P%d.%d cleared to logic low", gpio_port, gpio_pin);
	return OT_ERROR_NONE;
}

static otError cmd_gpio_get(void *ctx, uint8_t argc, char *argv[])
{
	if (argc != 2) {
		shell_print("Bad parameters count");
		return OT_ERROR_INVALID_ARGS;
	}

	uint8_t gpio_port = atoi(argv[0]);
	uint8_t gpio_pin = atoi(argv[1]);
	if (gpio_port > 2) {
		shell_print("Invalid GPIO port: %d. Should be between 0-2", gpio_port);
		return OT_ERROR_INVALID_ARGS;
	}
	if (gpio_pin > 31) {
		shell_print("Invalid GPIO pin: %d. Should be between 0-31", gpio_pin);
		return OT_ERROR_INVALID_ARGS;
	}
	uint32_t gpio_pin_port_map = NRF_GPIO_PIN_MAP(gpio_port, gpio_pin);
	uint32_t gpio_out_state = nrf_gpio_pin_out_read(gpio_pin_port_map);
	shell_print("State of GPIO P%d.%02d: %d", gpio_port, gpio_pin, gpio_out_state);
	return OT_ERROR_NONE;
}

static otError cmd_print_gpio(void *ctx, uint8_t argc, char *argv[])
{
	struct radio_test_cmd cmds[] = {
		{"set", "Set GPIO to logic high <port> <pin>", cmd_gpio_set},
		{"clear", "Clear GPIO to logic low <port> <pin>", cmd_gpio_clear},
		{"get", "Get current logic level of GPIO <port> <pin>", cmd_gpio_get},
	};

