nrfconnect/sdk-nrf/subsys/mpsl/fem/hot_potato/radio_test_nrf54l/src/radio_cmd.c
	return exec_subcommand(cmds, ARRAY_SIZE(cmds), ctx, argc, argv);
}

__attribute__((section(".ramfunc"))) void cpu_work_ram(uint8_t duty_cycle)
{
	volatile int64_t i = 0;
	while (1) {
		if (duty_cycle == 100) {
			for (int j = 0; j < 50000; j++) {
				i++;
				i = i * 2;
				i = i / 2;
				i--;
				i++;
			}
			k_yield(); /* Yield to allow other threads to run */
		} else {
			uint32_t sleep_time_us = (100 - cpu_activity_duty_cycle) * 200;
			uint32_t work_time_us = cpu_activity_duty_cycle * 200;

			cpu_active = true;
			k_timer_start(&cpu_duty_cycle_timer, K_USEC(work_time_us), K_NO_WAIT);

			while (cpu_active) {
				i++;
				i = i * 2;
				i = i / 2;
				i--;
				i++;
				k_yield(); /* Yield to allow other threads to run */
			}

			k_sleep(K_USEC(sleep_time_us));
		}

		if (cpu_activity != 1) {
			return;
		}
	}
}

void cpu_work_rram(uint8_t duty_cycle)
{
	volatile int64_t i = 0;
	while (1) {
		if (duty_cycle == 100) {
			for (int j = 0; j < 50000; j++) {
				i++;
				i = i * 2;
				i = i / 2;
				i--;
				i++;
			}
			k_yield(); /* Yield to allow other threads to run */
		} else {
			uint32_t sleep_time_us = (100 - cpu_activity_duty_cycle) * 200;
			uint32_t work_time_us = cpu_activity_duty_cycle * 200;

			cpu_active = true;
			k_timer_start(&cpu_duty_cycle_timer, K_USEC(work_time_us), K_NO_WAIT);

			while (cpu_active) {
				i++;
				i = i * 2;
				i = i / 2;
				i--;
				i++;
				k_yield(); /* Yield to allow other threads to run */
			}

			k_sleep(K_USEC(sleep_time_us));
		}

		if (cpu_activity != 2) {
			return;
		}
	}
}

void cpu_activity_thread(void)
{
	/* Don't go any further until command to enable CPU activity is given */
	while (1) {
		if (cpu_activity == 0) { // IDLE
			k_sem_take(&cpu_activity_thread_start, K_FOREVER);
		} else if (cpu_activity == 1) { // Blocking RAM
			cpu_work_ram(cpu_activity_duty_cycle);
		} else if (cpu_activity == 2) { // Blocking RRAM
			cpu_work_rram(cpu_activity_duty_cycle);
		}
	}
}

K_THREAD_DEFINE(cpu_activity_thread_id, 1024, cpu_activity_thread, NULL, NULL, NULL,
		K_LOWEST_APPLICATION_THREAD_PRIO, 0, 0);

static otError cmd_cpu_activity_idle(void *ctx, uint8_t argc, char *argv[])
{
	cpu_activity = 0;
	return OT_ERROR_NONE;
}

static otError cmd_cpu_activity_blocking_ram(void *ctx, uint8_t argc, char *argv[])
{
	cpu_activity_duty_cycle = 100;
	cpu_activity = 1;
	k_sem_give(&cpu_activity_thread_start);
	return OT_ERROR_NONE;
}

static otError cmd_cpu_activity_blocking_rram(void *ctx, uint8_t argc, char *argv[])
{
	cpu_activity_duty_cycle = 100;
	cpu_activity = 2;
	k_sem_give(&cpu_activity_thread_start);
	return OT_ERROR_NONE;
}

static otError cmd_cpu_activity_blocking_ram_duty_cycle(void *ctx, uint8_t argc, char *argv[])
{
	int duty_cycle;

	if (argc != 1) {
		shell_print("Bad parameters count");
		return OT_ERROR_INVALID_ARGS;
	}

	duty_cycle = atoi(argv[0]);

	if (duty_cycle < 10 || duty_cycle > 90) {
		shell_print("Invalid duty cycle: %d. Should be between 10-90 (%%)", duty_cycle);
		return -EINVAL;
	}

	cpu_activity_duty_cycle = duty_cycle;
	cpu_activity = 1;
	k_sem_give(&cpu_activity_thread_start);

	return OT_ERROR_NONE;
}

static otError cmd_cpu_activity_blocking_rram_duty_cycle(void *ctx, uint8_t argc, char *argv[])
{
	int duty_cycle;

	if (argc != 1) {
		shell_print("Bad parameters count");
		return OT_ERROR_INVALID_ARGS;
	}

	duty_cycle = atoi(argv[0]);

	if (duty_cycle < 10 || duty_cycle > 90) {
		shell_print("Invalid duty cycle: %d. Should be between 10-90 (%%)", duty_cycle);
		return -EINVAL;
	}

	cpu_activity_duty_cycle = duty_cycle;
	cpu_activity = 2;
	k_sem_give(&cpu_activity_thread_start);

	return OT_ERROR_NONE;
}

static otError cmd_cpu_activity_set(void *ctx, uint8_t argc, char *argv[])
{
	struct radio_test_cmd cmds[] = {
		{"idle", "CPU goes to sleep whenever it can (default)", cmd_cpu_activity_idle},
		{"ram_function", "CPU executes a function from RAM doing calculations",
		 cmd_cpu_activity_blocking_ram},
		{"rram_function", "CPU executes a function from RRAM (NVM) doing calculations",
		 cmd_cpu_activity_blocking_rram},
		{"ram_duty_cycle",
		 "CPU switches between executing a function from RAM doing calculations and going "
		 "to sleep",
		 cmd_cpu_activity_blocking_ram_duty_cycle},
		{"rram_duty_cycle",
		 "CPU switches between executing a function from RRAM (NVM) doing calculations and "
		 "going to sleep",
		 cmd_cpu_activity_blocking_rram_duty_cycle},
	};

	return exec_subcommand(cmds, ARRAY_SIZE(cmds), ctx, argc, argv);
}

static otError cmd_crc_enable(void *ctx, uint8_t argc, char *argv[])
{
	shell_print("CRC enabled in packets");

	config.crc_enabled = true;

	return OT_ERROR_NONE;
}

static otError cmd_crc_disable(void *ctx, uint8_t argc, char *argv[])
{
	shell_print("CRC disabled in packets");

	config.crc_enabled = false;

	return OT_ERROR_NONE;
}

static otError cmd_print_crc(void *ctx, uint8_t argc, char *argv[])
{
	struct radio_test_cmd cmds[] = {
		{"enable", "Enable CRC in packets", cmd_crc_enable},
		{"disable", "Disable CRC in packets", cmd_crc_disable},
	};

	return exec_subcommand(cmds, ARRAY_SIZE(cmds), ctx, argc, argv);
}

static otError cmd_start_channel_set(void *ctx, uint8_t argc, char *argv[])
{
	uint32_t channel;

	if (argc != 1) {
		shell_print("Bad parameters count");
		return OT_ERROR_INVALID_ARGS;
	}

	channel = atoi(argv[0]);

	if (channel > 80) {
		shell_print("Channel must be between 0 and 80");
		return OT_ERROR_INVALID_ARGS;
	}

	config.channel_start = (uint8_t)channel;

	shell_print("Start channel set to: %d", channel);
	return OT_ERROR_NONE;
}

static otError cmd_end_channel_set(void *ctx, uint8_t argc, char *argv[])
{
	uint32_t channel;

	if (argc != 1) {
		shell_print("Bad parameters count");
		return OT_ERROR_INVALID_ARGS;
	}

	channel = atoi(argv[0]);

	if (channel > 80) {
		shell_print("Channel must be between 0 and 80");
		return OT_ERROR_INVALID_ARGS;
	}

	config.channel_end = (uint8_t)channel;

	shell_print("End channel set to: %d", channel);
	return OT_ERROR_NONE;
}

