nrfconnect/sdk-nrf/subsys/mpsl/fem/hot_potato/radio_test_nrf54l/src/radio_cmd.c
static otError cmd_time_set(void *ctx, uint8_t argc, char *argv[])
{
	uint32_t time;

	if (argc != 1) {
		shell_print("Bad parameters count");
		return OT_ERROR_INVALID_ARGS;
	}

	time = atoi(argv[0]);

	if (time > 99) {
		shell_print("Delay time must be between 0 and 99 ms");
		return OT_ERROR_INVALID_ARGS;
	}

	config.delay_ms = time;

	shell_print("Delay time set to: %d", time);
	return OT_ERROR_NONE;
}

static otError cmd_cancel(void *ctx, uint8_t argc, char *argv[])
{
	radio_test_cancel();
	test_in_progress = false;
	rx_test_in_progress = false;
	return OT_ERROR_NONE;
}

static otError cmd_nrf_1mbit(void *ctx, uint8_t argc, char *argv[])
{
	config.mode = NRF_RADIO_MODE_NRF_1MBIT;
	shell_print("Data rate: %s", STRINGIFY(NRF_RADIO_MODE_NRF_1MBIT));

	return OT_ERROR_NONE;
}

static otError cmd_nrf_2mbit(void *ctx, uint8_t argc, char *argv[])
{
	config.mode = NRF_RADIO_MODE_NRF_2MBIT;
	shell_print("Data rate: %s", STRINGIFY(NRF_RADIO_MODE_NRF_2MBIT));

	return OT_ERROR_NONE;
}

#if defined(RADIO_MODE_MODE_Nrf_250Kbit)
static otError cmd_nrf_250kbit(void *ctx, uint8_t argc, char *argv[])
{
	config.mode = NRF_RADIO_MODE_NRF_250KBIT;
	shell_print("Data rate: %s", STRINGIFY(NRF_RADIO_MODE_NRF_250KBIT));

	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_MODE_MODE_Nrf_250Kbit) */

#if defined(RADIO_MODE_MODE_Nrf_4Mbit0_5)
static otError cmd_nrf_4mbit_h_0_5(void *ctx, uint8_t argc, char *argv[])
{
	config.mode = NRF_RADIO_MODE_NRF_4MBIT_H_0_5;
	shell_print("Data rate: %s", STRINGIFY(NRF_RADIO_MODE_NRF_4MBIT_H_0_5));

	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_MODE_MODE_Nrf_4Mbit0_5) */

#if defined(RADIO_MODE_MODE_Nrf_4Mbit0_25)
static otError cmd_nrf_4mbit_h_0_25(void *ctx, uint8_t argc, char *argv[])
{
	config.mode = NRF_RADIO_MODE_NRF_4MBIT_H_0_25;
	shell_print("Data rate: %s", STRINGIFY(NRF_RADIO_MODE_NRF_4MBIT_H_0_25));

	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_MODE_MODE_Nrf_4Mbit0_25) */

static otError cmd_ble_1mbit(void *ctx, uint8_t argc, char *argv[])
{
	config.mode = NRF_RADIO_MODE_BLE_1MBIT;
	shell_print("Data rate: %s", STRINGIFY(NRF_RADIO_MODE_BLE_1MBIT));

	return OT_ERROR_NONE;
}

static otError cmd_ble_2mbit(void *ctx, uint8_t argc, char *argv[])
{
	config.mode = NRF_RADIO_MODE_BLE_2MBIT;
	shell_print("Data rate: %s", STRINGIFY(NRF_RADIO_MODE_BLE_2MBIT));

	return OT_ERROR_NONE;
}

#if CONFIG_HAS_HW_NRF_RADIO_BLE_CODED
static otError cmd_ble_lr125kbit(void *ctx, uint8_t argc, char *argv[])
{
	config.mode = NRF_RADIO_MODE_BLE_LR125KBIT;
	shell_print("Data rate: %s", STRINGIFY(NRF_RADIO_MODE_BLE_LR125KBIT));

	return OT_ERROR_NONE;
}

static otError cmd_ble_lr500kbit(void *ctx, uint8_t argc, char *argv[])
{
	config.mode = NRF_RADIO_MODE_BLE_LR500KBIT;
	shell_print("Data rate: %s", STRINGIFY(NRF_RADIO_MODE_BLE_LR500KBIT));

	return OT_ERROR_NONE;
}
#endif /* CONFIG_HAS_HW_NRF_RADIO_BLE_CODED */

#if CONFIG_HAS_HW_NRF_RADIO_IEEE802154
static otError cmd_ble_ieee(void *ctx, uint8_t argc, char *argv[])
{
	config.mode = NRF_RADIO_MODE_IEEE802154_250KBIT;
	shell_print("Data rate: %s", STRINGIFY(NRF_RADIO_MODE_IEEE802154_250KBIT));

	return OT_ERROR_NONE;
}
#endif /* CONFIG_HAS_HW_NRF_RADIO_IEEE802154 */

static otError cmd_data_rate_set(void *ctx, uint8_t argc, char *argv[])
{
	struct radio_test_cmd cmds[] = {
		{"nrf_1Mbit", "1 Mbit/s Nordic proprietary radio mode", cmd_nrf_1mbit},
		{"nrf_2Mbit", "2 Mbit/s Nordic proprietary radio mode", cmd_nrf_2mbit},
#if defined(RADIO_MODE_MODE_Nrf_250Kbit)
		{"nrf_250Kbit", "250 kbit/s Nordic proprietary radio mode", cmd_nrf_250kbit},
#endif /* defined(RADIO_MODE_MODE_Nrf_250Kbit) */
#if defined(RADIO_MODE_MODE_Nrf_4Mbit0_5)
		{"nrf_4Mbit0_5", "4 Mbit/s Nordic proprietary radio mode (BT=0.5/h=0.5)",
		 cmd_nrf_4mbit_h_0_5},
#endif /* defined(RADIO_MODE_MODE_Nrf_4Mbit0_5) */
#if defined(RADIO_MODE_MODE_Nrf_4Mbit0_25)
		{"nrf_4Mbit0_25", NULL, "4 Mbit/s Nordic proprietary radio mode (BT=0.5/h=0.25)",
		 cmd_nrf_4mbit_h_0_25},
#endif /* defined(RADIO_MODE_MODE_Nrf_4Mbit0_25) */
		{"ble_1Mbit", "1 Mbit/s Bluetooth Low Energy", cmd_ble_1mbit},
		{"ble_2Mbit", "2 Mbit/s Bluetooth Low Energy", cmd_ble_2mbit},
#if CONFIG_HAS_HW_NRF_RADIO_BLE_CODED
		{"ble_lr125Kbit", "Long range 125 kbit/s TX, 125 kbit/s and 500 kbit/s RX",
		 cmd_ble_lr125kbit},
		{"ble_lr500Kbit", "Long range 500 kbit/s TX, 125 kbit/s and 500 kbit/s RX",
		 cmd_ble_lr500kbit},
#endif /* CONFIG_HAS_HW_NRF_RADIO_BLE_CODED */
#if CONFIG_HAS_HW_NRF_RADIO_IEEE802154
		{"ieee802154_250Kbit", "IEEE 802.15.4-2006 250 kbit/s", cmd_ble_ieee},
#endif /* CONFIG_HAS_HW_NRF_RADIO_IEEE802154 */
	};

	return exec_subcommand(cmds, ARRAY_SIZE(cmds), ctx, argc, argv);
}

static otError cmd_tx_carrier_start(void *ctx, uint8_t argc, char *argv[])
{
	if (test_in_progress) {
		radio_test_cancel();
		test_in_progress = false;
	}

#if CONFIG_HAS_HW_NRF_RADIO_IEEE802154
	ieee_channel_check(config.channel_start);
#endif /* CONFIG_HAS_HW_NRF_RADIO_IEEE802154 */

	memset(&test_config, 0, sizeof(test_config));
	test_config.type = UNMODULATED_TX;
	test_config.mode = config.mode;
	test_config.params.unmodulated_tx.txpower = config.txpower;
	test_config.params.unmodulated_tx.channel = config.channel_start;
	test_config.crc_enabled = config.crc_enabled;
	radio_test_start(&test_config);

	shell_print("Start the TX carrier");
	return OT_ERROR_NONE;
}

static void tx_modulated_carrier_end(void)
{
	printk("The modulated TX has finished\n");
}

static otError cmd_tx_modulated_carrier_start(void *ctx, uint8_t argc, char *argv[])
{
	uint32_t tx_payload_length = RADIO_MAX_PAYLOAD_LEN;

	if (test_in_progress) {
		radio_test_cancel();
		test_in_progress = false;
	}

	memset(&test_config, 0, sizeof(test_config));

	if (argc > 2) {
		shell_print("Bad parameters count");
		return OT_ERROR_INVALID_ARGS;
	}

	if (argc >= 1) {
		test_config.params.modulated_tx.packets_num = atoi(argv[0]);
		test_config.params.modulated_tx.cb = tx_modulated_carrier_end;
	}

	if (argc == 2) {
		tx_payload_length = atoi(argv[1]);

		if (tx_payload_length > RADIO_MAX_PAYLOAD_LEN) {
			shell_print("Payload size can be max %d bytes", RADIO_MAX_PAYLOAD_LEN);
			shell_print("Payload set to %d", RADIO_MAX_PAYLOAD_LEN);
			tx_payload_length = RADIO_MAX_PAYLOAD_LEN;
		}
	}

#if CONFIG_HAS_HW_NRF_RADIO_IEEE802154
	if (config.mode == NRF_RADIO_MODE_IEEE802154_250KBIT) {
		if (tx_payload_length > IEEE_MAX_PAYLOAD_LEN) {
			shell_print("Payload size can be max %d bytes in IEEE802.15.4 mode",
				    IEEE_MAX_PAYLOAD_LEN);

			shell_print("Payload set to %d", IEEE_MAX_PAYLOAD_LEN);
			tx_payload_length = IEEE_MAX_PAYLOAD_LEN;
		}
	}
	ieee_channel_check(config.channel_start);
#endif /* CONFIG_HAS_HW_NRF_RADIO_IEEE802154 */

