nrfconnect/sdk-nrf/subsys/mpsl/fem/hot_potato/radio_test_nrf54l/src/radio_cmd.c
	test_config.type = MODULATED_TX;
	test_config.mode = config.mode;
	test_config.params.modulated_tx.txpower = config.txpower;
	test_config.params.modulated_tx.channel = config.channel_start;
	test_config.params.modulated_tx.pattern = config.tx_pattern;
	test_config.params.modulated_tx.payload_size = tx_payload_length;
	test_config.crc_enabled = config.crc_enabled;

	radio_test_start(&test_config);

	shell_print("Start the modulated TX carrier");
	return OT_ERROR_NONE;
}

static otError cmd_duty_cycle_set(void *ctx, uint8_t argc, char *argv[])
{
	uint32_t duty_cycle;

	if (argc != 1) {
		shell_print("Bad parameters count");
		return OT_ERROR_INVALID_ARGS;
	}

	duty_cycle = atoi(argv[0]);

	if (duty_cycle > 90) {
		shell_print("Duty cycle must be between 1 and 90");
		return OT_ERROR_INVALID_ARGS;
	}

	config.duty_cycle = duty_cycle;

#if CONFIG_HAS_HW_NRF_RADIO_IEEE802154
	ieee_channel_check(config.channel_start);
#endif /* CONFIG_HAS_HW_NRF_RADIO_IEEE802154 */

	memset(&test_config, 0, sizeof(test_config));
	test_config.type = MODULATED_TX_DUTY_CYCLE;
	test_config.mode = config.mode;
	test_config.params.modulated_tx_duty_cycle.txpower = config.txpower;
	test_config.params.modulated_tx_duty_cycle.pattern = config.tx_pattern;
	test_config.params.modulated_tx_duty_cycle.channel = config.channel_start;
	test_config.params.modulated_tx_duty_cycle.duty_cycle = config.duty_cycle;
	test_config.crc_enabled = config.crc_enabled;

	radio_test_start(&test_config);
	test_in_progress = true;

	return OT_ERROR_NONE;
}

static otError cmd_interval_set(void *ctx, uint8_t argc, char *argv[])
{
	uint32_t interval;
	uint32_t tx_payload_length = RADIO_MAX_PAYLOAD_LEN;

	if (argc != 1 && argc != 2) {
		shell_print("Bad parameters count");
		return OT_ERROR_INVALID_ARGS;
	}

	interval = atoi(argv[0]);

	if (interval < 1 || interval > MODULATED_TX_INTERVAL_MAX_MS) {
		shell_print("Interval must be between 1 and %d", MODULATED_TX_INTERVAL_MAX_MS);
		return OT_ERROR_INVALID_ARGS;
	}

	config.interval = interval;

	if (argc == 2) {
		tx_payload_length = atoi(argv[1]);

		if (tx_payload_length > RADIO_MAX_PAYLOAD_LEN) {
			shell_print("Payload size can be max %d bytes", RADIO_MAX_PAYLOAD_LEN);
			shell_print("Payload set to %d", RADIO_MAX_PAYLOAD_LEN);
			tx_payload_length = RADIO_MAX_PAYLOAD_LEN;
		}
	}

#if CONFIG_HAS_HW_NRF_RADIO_IEEE802154
	if (config.mode == NRF_RADIO_MODE_IEEE802154_250KBIT) {
		if (tx_payload_length > IEEE_MAX_PAYLOAD_LEN) {
			shell_print("Payload size can be max %d bytes in IEEE802.15.4 mode",
				    IEEE_MAX_PAYLOAD_LEN);

			shell_print("Payload set to %d", IEEE_MAX_PAYLOAD_LEN);
			tx_payload_length = IEEE_MAX_PAYLOAD_LEN;
		}
	}
	ieee_channel_check(config.channel_start);
#endif /* CONFIG_HAS_HW_NRF_RADIO_IEEE802154 */

	memset(&test_config, 0, sizeof(test_config));
	test_config.type = MODULATED_TX_INTERVAL;
	test_config.mode = config.mode;
	test_config.params.modulated_tx_interval.txpower = config.txpower;
	test_config.params.modulated_tx_interval.pattern = config.tx_pattern;
	test_config.params.modulated_tx_interval.channel = config.channel_start;
	test_config.params.modulated_tx_interval.interval = config.interval;
	test_config.params.modulated_tx_interval.payload_size = tx_payload_length;
	test_config.crc_enabled = config.crc_enabled;

	radio_test_start(&test_config);
	test_in_progress = true;

	return OT_ERROR_NONE;
}

#if defined(TOGGLE_DCDC_HELP)
static otError cmd_toggle_dc(void *ctx, uint8_t argc, char *argv[])
{
	uint32_t state;

	if (argc != 1) {
		shell_print("Bad parameters count");
		return OT_ERROR_INVALID_ARGS;
	}

	state = atoi(argv[0]);
	if (state > 1) {
		shell_print("Invalid DCDC value provided");
		return OT_ERROR_INVALID_ARGS;
	}

	toggle_dcdc_state((uint8_t)state);

#if NRF_POWER_HAS_DCDCEN_VDDH
	shell_print("DCDC VDDH state %d\n"
		    "Write '0' to toggle state of DCDC REG0\n"
		    "Write '1' to toggle state of DCDC REG1",
		    nrf_power_dcdcen_vddh_get(NRF_POWER));
#endif /* NRF_POWER_HAS_DCDCEN_VDDH */

#if NRF_POWER_HAS_DCDCEN
	shell_print("DCDC state %d\n"
		    "Write '1' or '0' to toggle",
		    nrf_power_dcdcen_get(NRF_POWER));
#endif /* NRF_POWER_HAS_DCDCEN */

	return OT_ERROR_NONE;
}
#endif

#if defined(RADIO_TXPOWER_TXPOWER_Pos10dBm)
static otError cmd_pos10dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = 10;
	shell_print("TX power: %d", config.txpower);
	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos10dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Pos9dBm)
static otError cmd_pos9dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = 9;
	shell_print("TX power: %d", config.txpower);
	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos9dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Pos8dBm)
static otError cmd_pos8dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = 8;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos8dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Pos7dBm)
static otError cmd_pos7dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = 7;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos7dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Pos6dBm)
static otError cmd_pos6dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = 6;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos6dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Pos5dBm)
static otError cmd_pos5dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = 5;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos5dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Pos4dBm)
static otError cmd_pos4dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = 4;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos4dBm) */

