nrfconnect/sdk-nrf/subsys/mpsl/fem/hot_potato/radio_test_nrf54l/src/radio_cmd.c
#if defined(RADIO_TXPOWER_TXPOWER_Pos3dBm)
static otError cmd_pos3dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = 3;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos3dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Pos2dBm)
static otError cmd_pos2dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = 2;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos2dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Pos1dBm)
static otError cmd_pos1dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = 1;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos1dBm) */

static otError cmd_pos0dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = 0;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}

#if defined(RADIO_TXPOWER_TXPOWER_Neg1dBm)
static otError cmd_neg1dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = -1;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg1dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Neg2dBm)
static otError cmd_neg2dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = -2;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg2dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Neg3dBm)
static otError cmd_neg3dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = -3;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg3dBm) */

static otError cmd_neg4dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = -4;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}

#if defined(RADIO_TXPOWER_TXPOWER_Neg5dBm)
static otError cmd_neg5dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = -5;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg5dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Neg6dBm)
static otError cmd_neg6dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = -6;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg6dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Neg7dBm)
static otError cmd_neg7dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = -7;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg7dBm) */

static otError cmd_neg8dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = -8;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}

#if defined(RADIO_TXPOWER_TXPOWER_Neg9dBm)
static otError cmd_neg9dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = -9;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg9dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Neg10dBm)
static otError cmd_neg10dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = -10;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg10dBm) */

static otError cmd_neg12dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = -12;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}

#if defined(RADIO_TXPOWER_TXPOWER_Neg14dBm)
static otError cmd_neg14dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = -14;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg14dBm) */

static otError cmd_neg16dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = -16;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}

static otError cmd_neg20dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = -20;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}

#if defined(RADIO_TXPOWER_TXPOWER_Neg26dBm)
static otError cmd_neg26dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = -26;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg26dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Neg30dBm)
static otError cmd_neg30dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = -30;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg30dBm) */

static otError cmd_neg40dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = -40;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}

#if defined(RADIO_TXPOWER_TXPOWER_Neg46dBm)
static otError cmd_neg46dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = -46;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg46dBm) */

#if defined(RADIO_TXPOWER_TXPOWER_Neg70dBm)
static otError cmd_neg70dbm(void *ctx, uint8_t argc, char *argv[])
{
	config.txpower = -70;
	shell_print("TX power : %d dBm", config.txpower);
	return OT_ERROR_NONE;
}
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg70dBm) */

static otError cmd_output_power_set(void *ctx, uint8_t argc, char *argv[])
{
	struct radio_test_cmd cmds[] = {
#if defined(RADIO_TXPOWER_TXPOWER_Pos10dBm)
		{"pos10dBm", "TX power: +10 dBm", cmd_pos10dbm},
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos10dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Pos9dBm)
		{"pos9dBm", "TX power: +9 dBm", cmd_pos9dbm},
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos9dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Pos8dBm)
		{"pos8dBm", "TX power: +8 dBm", cmd_pos8dbm},
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos8dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Pos7dBm)
		{"pos7dBm", "TX power: +7 dBm", cmd_pos7dbm},
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos7dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Pos6dBm)
		{"pos6dBm", "TX power: +6 dBm", cmd_pos6dbm},
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos6dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Pos5dBm)
		{"pos5dBm", "TX power: +5 dBm", cmd_pos5dbm},
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos5dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Pos4dBm)
		{"pos4dBm", "TX power: +4 dBm", cmd_pos4dbm},
#endif /* RADIO_TXPOWER_TXPOWER_Pos4dBm */
#if defined(RADIO_TXPOWER_TXPOWER_Pos3dBm)
		{"pos3dBm", "TX power: +3 dBm", cmd_pos3dbm},
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos3dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Pos2dBm)
		{"pos2dBm", "TX power: +2 dBm", cmd_pos2dbm},
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos2dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Pos1dBm)
		{"pos1dBm", "TX power: +1 dBm", cmd_pos1dbm},
#endif /* defined(RADIO_TXPOWER_TXPOWER_Pos1dBm) */
		{"pos0dBm", "TX power: 0 dBm", cmd_pos0dbm},
#if defined(RADIO_TXPOWER_TXPOWER_Neg1dBm)
		{"neg1dBm", "TX power: -1 dBm", cmd_neg1dbm},
#endif /* RADIO_TXPOWER_TXPOWER_Neg1dBm */
#if defined(RADIO_TXPOWER_TXPOWER_Neg2dBm)
		{"neg2dBm", "TX power: -2 dBm", cmd_neg2dbm},
#endif /* RADIO_TXPOWER_TXPOWER_Neg2dBm */
#if defined(RADIO_TXPOWER_TXPOWER_Neg3dBm)
		{"neg3dBm", "TX power: -3 dBm", cmd_neg3dbm},
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg3dBm) */
		{"neg4dBm", "TX power: -4 dBm", cmd_neg4dbm},
#if defined(RADIO_TXPOWER_TXPOWER_Neg5dBm)
		{"neg5dBm", "TX power: -5 dBm", cmd_neg5dbm},
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg5dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Neg6dBm)
		{"neg6dBm", "TX power: -6 dBm", cmd_neg6dbm},
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg6dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Neg7dBm)
		{"neg7dBm", "TX power: -7 dBm", cmd_neg7dbm},
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg7dBm) */
		{"neg8dBm", "TX power: -8 dBm", cmd_neg8dbm},
#if defined(RADIO_TXPOWER_TXPOWER_Neg9dBm)
		{"neg9dBm", "TX power: -9 dBm", cmd_neg9dbm},
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg9dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Neg10dBm)
		{"neg10dBm", "TX power: -10 dBm", cmd_neg10dbm},
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg10dBm) */
		{"neg12dBm", "TX power: -12 dBm", cmd_neg12dbm},
#if defined(RADIO_TXPOWER_TXPOWER_Neg14dBm)
		{"neg14dBm", "TX power: -14 dBm", cmd_neg14dbm},
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg14dBm) */
		{"neg16dBm", "TX power: -16 dBm", cmd_neg16dbm},
		{"neg20dBm", "TX power: -20 dBm", cmd_neg20dbm},
#if defined(RADIO_TXPOWER_TXPOWER_Neg26dBm)
		{"neg26dBm", "TX power: -26 dBm", cmd_neg26dbm},
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg26dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Neg30dBm)
		{"neg30dBm", "TX power: -30 dBm", cmd_neg30dbm},
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg30dBm) */
		{"neg40dBm", "TX power: -40 dBm", cmd_neg40dbm},
#if defined(RADIO_TXPOWER_TXPOWER_Neg46dBm)
		{"neg46dBm", "TX power: -46 dBm", cmd_neg46dbm},
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg46dBm) */
#if defined(RADIO_TXPOWER_TXPOWER_Neg70dBm)
		{"neg70dBm", "TX power: -70 dBm", cmd_neg70dbm},
#endif /* defined(RADIO_TXPOWER_TXPOWER_Neg70dBm) */
	};

