nrfconnect/sdk-nrf/subsys/mpsl/fem/hot_potato/radio_test_nrf54l/src/radio_cmd.c
	return exec_subcommand(cmds, ARRAY_SIZE(cmds), ctx, argc, argv);
}

static otError cmd_pattern_random(void *ctx, uint8_t argc, char *argv[])
{
	config.tx_pattern = TRANSMIT_PATTERN_RANDOM;
	shell_print("Transmission pattern: %s", STRINGIFY(TRANSMIT_PATTERN_RANDOM));

	return OT_ERROR_NONE;
}

static otError cmd_pattern_11110000(void *ctx, uint8_t argc, char *argv[])
{
	config.tx_pattern = TRANSMIT_PATTERN_11110000;
	shell_print("Transmission pattern: %s", STRINGIFY(TRANSMIT_PATTERN_11110000));

	return OT_ERROR_NONE;
}

static otError cmd_pattern_11001100(void *ctx, uint8_t argc, char *argv[])
{
	config.tx_pattern = TRANSMIT_PATTERN_11001100;
	shell_print("Transmission pattern: %s", STRINGIFY(TRANSMIT_PATTERN_11001100));

	return OT_ERROR_NONE;
}

static otError cmd_transmit_pattern_set(void *ctx, uint8_t argc, char *argv[])
{
	struct radio_test_cmd cmds[] = {
		{"pattern_random", "Set transmission pattern to random", cmd_pattern_random},
		{"pattern_11110000", "Set transmission pattern to 11110000", cmd_pattern_11110000},
		{"pattern_11001100", "Set transmission pattern to 10101010", cmd_pattern_11001100},
	};

	return exec_subcommand(cmds, ARRAY_SIZE(cmds), ctx, argc, argv);
}

static otError cmd_print(void *ctx, uint8_t argc, char *argv[])
{
	shell_print("Parameters:");

	switch (config.mode) {
#if defined(RADIO_MODE_MODE_Nrf_250Kbit)
	case NRF_RADIO_MODE_NRF_250KBIT:
		shell_print("Data rate: %s", STRINGIFY(NRF_RADIO_MODE_NRF_250KBIT));
		break;

#endif /* defined(RADIO_MODE_MODE_Nrf_250Kbit) */

#if defined(RADIO_MODE_MODE_Nrf_4Mbit0_5)
	case NRF_RADIO_MODE_NRF_4MBIT_H_0_5:
		shell_print("Data rate: %s", STRINGIFY(NRF_RADIO_MODE_NRF_4MBIT_H_0_5));
		break;
#endif /* defined(RADIO_MODE_MODE_Nrf_4Mbit0_5) */

#if defined(RADIO_MODE_MODE_Nrf_4Mbit0_25)
	case NRF_RADIO_MODE_NRF_4MBIT_H_0_25:
		shell_print("Data rate: %s", STRINGIFY(NRF_RADIO_MODE_NRF_4MBIT_H_0_25));
		break;
#endif /* defined(RADIO_MODE_MODE_Nrf_4Mbit0_25) */

	case NRF_RADIO_MODE_NRF_1MBIT:
		shell_print("Data rate: %s", STRINGIFY(NRF_RADIO_MODE_NRF_1MBIT));
		break;

	case NRF_RADIO_MODE_NRF_2MBIT:
		shell_print("Data rate: %s", STRINGIFY(NRF_RADIO_MODE_NRF_2MBIT));
		break;

	case NRF_RADIO_MODE_BLE_1MBIT:
		shell_print("Data rate: %s", STRINGIFY(NRF_RADIO_MODE_BLE_1MBIT));
		break;

	case NRF_RADIO_MODE_BLE_2MBIT:
		shell_print("Data rate: %s", STRINGIFY(NRF_RADIO_MODE_BLE_2MBIT));
		break;

#if CONFIG_HAS_HW_NRF_RADIO_BLE_CODED
	case NRF_RADIO_MODE_BLE_LR125KBIT:
		shell_print("Data rate: %s", STRINGIFY(NRF_RADIO_MODE_BLE_LR125KBIT));
		break;

	case NRF_RADIO_MODE_BLE_LR500KBIT:
		shell_print("Data rate: %s", STRINGIFY(NRF_RADIO_MODE_BLE_LR500KBIT));
		break;
#endif /* CONFIG_HAS_HW_NRF_RADIO_BLE_CODED */

#if CONFIG_HAS_HW_NRF_RADIO_IEEE802154
	case NRF_RADIO_MODE_IEEE802154_250KBIT:
		shell_print("Data rate: %s", STRINGIFY(NRF_RADIO_MODE_IEEE802154_250KBIT));
		break;
#endif /* CONFIG_HAS_HW_NRF_RADIO_IEEE802154 */

	default:
		shell_print("Data rate unknown or deprecated: %d\n\r", config.mode);
		break;
	}

	shell_print("TX power : %d dBm", config.txpower);

	switch (config.tx_pattern) {
	case TRANSMIT_PATTERN_RANDOM:
		shell_print("Transmission pattern: %s", STRINGIFY(TRANSMIT_PATTERN_RANDOM));
		break;

	case TRANSMIT_PATTERN_11110000:
		shell_print("Transmission pattern: %s", STRINGIFY(TRANSMIT_PATTERN_11110000));
		break;

	case TRANSMIT_PATTERN_11001100:
		shell_print("Transmission pattern: %s", STRINGIFY(TRANSMIT_PATTERN_11001100));
		break;

	default:
		shell_print("Transmission pattern unknown: %d", config.tx_pattern);
		break;
	}

	shell_print("CRC : %s", config.crc_enabled ? "Enabled" : "Disabled");

	shell_print("Start Channel: %u\n"
		    "End Channel: %u\n"
		    "Time on each channel: %u ms\n"
		    "Duty cycle: %u percent\n",
		    (unsigned)config.channel_start, (unsigned)config.channel_end, config.delay_ms,
		    config.duty_cycle);

	return OT_ERROR_NONE;
}

static otError cmd_rx_sweep_start(void *ctx, uint8_t argc, char *argv[])
{
	memset(&test_config, 0, sizeof(test_config));
	test_config.type = RX_SWEEP;
	test_config.mode = config.mode;
	test_config.params.rx_sweep.channel_start = config.channel_start;
	test_config.params.rx_sweep.channel_end = config.channel_end;
	test_config.params.rx_sweep.delay_ms = config.delay_ms;
	test_config.crc_enabled = config.crc_enabled;

	radio_test_start(&test_config);

	test_in_progress = true;
	rx_test_in_progress = true;

	shell_print("RX sweep");
	return OT_ERROR_NONE;
}

static otError cmd_tx_sweep_start(void *ctx, uint8_t argc, char *argv[])
{
	memset(&test_config, 0, sizeof(test_config));
	test_config.type = TX_SWEEP;
	test_config.mode = config.mode;
	test_config.params.tx_sweep.channel_start = config.channel_start;
	test_config.params.tx_sweep.channel_end = config.channel_end;
	test_config.params.tx_sweep.delay_ms = config.delay_ms;
	test_config.params.tx_sweep.txpower = config.txpower;
	test_config.crc_enabled = config.crc_enabled;

	radio_test_start(&test_config);

	test_in_progress = true;

	shell_print("TX sweep");
	return OT_ERROR_NONE;
}

static otError cmd_rx_start(void *ctx, uint8_t argc, char *argv[])
{
	if (test_in_progress) {
		radio_test_cancel();
		test_in_progress = false;
	}

#if CONFIG_HAS_HW_NRF_RADIO_IEEE802154
	ieee_channel_check(config.channel_start);
#endif /* CONFIG_HAS_HW_NRF_RADIO_IEEE802154 */

	memset(&test_config, 0, sizeof(test_config));
	test_config.type = RX;
	test_config.mode = config.mode;
	test_config.params.rx.channel = config.channel_start;
	test_config.params.rx.pattern = config.tx_pattern;
	test_config.crc_enabled = config.crc_enabled;

	radio_test_start(&test_config);
	test_in_progress = true;
	rx_test_in_progress = true;

	return OT_ERROR_NONE;
}

static otError cmd_print_payload(void *ctx, uint8_t argc, char *argv[])
{
	struct radio_rx_stats rx_stats;

	memset(&rx_stats, 0, sizeof(rx_stats));

	radio_rx_stats_get(&rx_stats);

	shell_print("Received payload:");
	shell_hexdump(rx_stats.last_packet.buf, rx_stats.last_packet.len);
	shell_print("Number of packets: %d", rx_stats.packet_cnt);

	if (argc == 1) {
		uint32_t num_average_rssi_samples = atoi(argv[0]);
		if (num_average_rssi_samples > MAX_RSSISAMPLE_STORED ||
		    num_average_rssi_samples < 1) {
			shell_print("Invalid parameter: %s. Maximum supported number of RSSI "
				    "samples stored: %d",
				    argv[0], MAX_RSSISAMPLE_STORED);
			return OT_ERROR_INVALID_ARGS;
		} else {
			if (rx_stats.packet_cnt < num_average_rssi_samples) {
				shell_print("Only received %d packets, reporing RSSI for received "
					    "packets only",
					    rx_stats.packet_cnt);
				num_average_rssi_samples = rx_stats.packet_cnt;
			}
			uint8_t averaged_rssi_measurement =
				rssi_sample_averaged_packets_get(num_average_rssi_samples);
			shell_print("Averaged RSSI for last %d packets: -%d",
				    num_average_rssi_samples, averaged_rssi_measurement);
		}
	}

	return OT_ERROR_NONE;
}

#if CONFIG_RADIO_TEST_POWER_CONTROL_AUTOMATIC
static otError cmd_total_output_power_set(void *ctx, uint8_t argc, char *argv[])
{
	int power;

