nrfconnect/sdk-nrf/subsys/mpsl/fem/hot_potato/radio_test_nrf54l/src/radio_cmd.c
	if (argc != 1) {
		shell_print("Bad parameters count");
		return OT_ERROR_INVALID_ARGS;
	}

	power = atoi(argv[0]);

	if ((power > INT8_MAX) || (power < INT8_MIN)) {
		shell_print("Out of range power value");
		return OT_ERROR_INVALID_ARGS;
	}

	config.txpower = (int8_t)power;

	return OT_ERROR_NONE;
}
#endif /* CONFIG_RADIO_TEST_POWER_CONTROL_AUTOMATIC */

static otError cmd_rssi_get(void *ctx, uint8_t argc, char *argv[])
{
	if (!(test_in_progress && rx_test_in_progress)) {
		shell_print("Invalid state, RSSI only available during RX test");
		return OT_ERROR_INVALID_STATE;
	}

	if (argc > 1) {
		shell_print("Bad parameters count");
		return OT_ERROR_INVALID_ARGS;
	}

	int num_samples = 1;
	if (argc == 1) {
		num_samples = atoi(argv[0]);
		if (num_samples < 1) {
			shell_print("Cannot do negative number of RSSI samples");
			return OT_ERROR_INVALID_ARGS;
		}
	}

	int rssi_sample = 0;
	for (int i = 0; i < num_samples; i++) {
		NRF_RADIO->TASKS_RSSISTART = 1;
		k_usleep(1);
		rssi_sample += NRF_RADIO->RSSISAMPLE;
	}
	rssi_sample /= num_samples;
	shell_print("Results of %d instant RSSI samples averaged: -%d", num_samples, rssi_sample);

	return OT_ERROR_NONE;
}

static otError cmd_temp_get(void *ctx, uint8_t argc, char *argv[])
{
	NRF_TEMP->EVENTS_DATARDY = 0;
	NRF_TEMP->TASKS_START = 1;
	while (!NRF_TEMP->EVENTS_DATARDY)
		;
	NRF_TEMP->EVENTS_DATARDY = 0;

	int32_t temperature_sample = NRF_TEMP->TEMP;
	uint32_t temperature_fraction = (temperature_sample & 0x00000003) * 25;

	shell_print("Die temperature: %d.%d", (temperature_sample >> 2), temperature_fraction);
	return OT_ERROR_NONE;
}

static otError cmd_start(void *ctx, uint8_t argc, char *argv[])
{
	int rc;

	rc = radio_test_init(&test_config);

	if (rc) {
		shell_print("Cannot initialize radio test: %d", rc);
		return OT_ERROR_FAILED;
	}

	return OT_ERROR_NONE;
}

otError VendorRadioTest(void *ctx, uint8_t argc, char *argv[])
{
	struct radio_test_cmd cmds[] = {
		{"start_channel",
		 "Start channel for sweep or channel for constant carrier <channel>",
		 cmd_start_channel_set},
		{"end_channel", "End channel for sweep or channel for constant carrier <channel>",
		 cmd_end_channel_set},
		{"time_on_channel", "Time on each channel in ms (1-99) <time>", cmd_time_set},
		{"cancel", "Cancel sweep or carrier", cmd_cancel},
		{"data_rate", "Set data rate", cmd_data_rate_set},
		{"start_tx_carrier", "Start TX carrier", cmd_tx_carrier_start},
		{"start_tx_modulated_carrier",
		 "Start modulated TX carrier [num packets] [tx payload len]",
		 cmd_tx_modulated_carrier_start},
		{"output_power",
		 "Set output power. For FEM with automatic power control, this includes FEM gain",
		 cmd_output_power_set},
#if CONFIG_RADIO_TEST_POWER_CONTROL_AUTOMATIC
		{"total_output_power", "Set output power in dBm, including FEM gain <tx power>",
		 cmd_total_output_power_set},
#endif /* CONFIG_RADIO_TEST_POWER_CONTROL_AUTOMATIC */
		{"transmit_pattern", "Set TX pattern", cmd_transmit_pattern_set},
		{"start_duty_cycle_modulated_tx",
		 "Duty cycle in percent (two decimal digits, 01-90) <duty_cycle>",
		 cmd_duty_cycle_set},
		{"start_interval_modulated_tx",
		 "Interval of packet TX (1 to 10000 ms) <interval> [tx payload len]",
		 cmd_interval_set},
		{"parameters_print", "Print current delay, channel and so on", cmd_print},
		{"start_rx_sweep", "Start RX sweep", cmd_rx_sweep_start},
		{"start_tx_sweep", "Start TX sweep", cmd_tx_sweep_start},
		{"start_rx", "Start RX", cmd_rx_start},
		{"print_rx", "Print RX payload", cmd_print_payload},
		{"crc", "Enable or disable CRC ", cmd_print_crc},
		{"gpio", "Set or clear GPIO output", cmd_print_gpio},
		{"rssi", "Get instant RSSI Sample", cmd_rssi_get},
		{"temp", "Get die temperature", cmd_temp_get},
		{"cpu_activity", "Set CPU activity during radio operations", cmd_cpu_activity_set},
#if defined(TOGGLE_DCDC_HELP)
		{"toggle_dcdc_state", TOGGLE_DCDC_HELP, cmd_toggle_dc},
#endif
		{"start", "Start radio test", cmd_start},
	};

	return exec_subcommand(cmds, ARRAY_SIZE(cmds), ctx, argc, argv);
}
